EDT/УТ/src/Documents/мгЗагрузкаИзЗУП/мгЗагрузкаИзЗУП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>мгЗагрузкаИзЗУП</name>
  <registerRecords>AccumulationRegister.мгЗарплатаУдержания</registerRecords>
  <attributes>
    <name>ИсточникДанныхДляРасчетаФОТ</name>
    <type>
      <types>CatalogRef.мгИсточникиДанныхДляРасчетаФОТ</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Терминал</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>АвансЗарПлата</name>
    <attributes>
      <name>ТабельныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.новаЭкспедиторы</types>
        <types>CatalogRef.новаВодители</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсполнительныйЛист</name>
    <attributes>
      <name>ТабельныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.новаЭкспедиторы</types>
        <types>CatalogRef.новаВодители</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОтпускныеБольничные</name>
    <attributes>
      <name>ТабельныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.новаЭкспедиторы</types>
        <types>CatalogRef.новаВодители</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/AccumulationRegisters/мгЗарплатаУдержания/мгЗарплатаУдержания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>мгЗарплатаУдержания</name>
  <resources>
    <name>Тариф</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Терминал</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидУдержания</name>
    <type>
      <types>CatalogRef.мгНачисленияУдержания</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.новаЭкспедиторы</types>
      <types>CatalogRef.новаВодители</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

EDT/УТ/src/Catalogs/мгНачисленияУдержания/мгНачисленияУдержания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>мгНачисленияУдержания</name>
  <predefined>
    <items>
      <name>ВСчетЗП</name>
      <description>В счет ЗП</description>
    </items>
    <items>
      <name>ВыданАвансИЗП</name>
      <description>Выдан аванс и ЗП</description>
    </items>
    <items>
      <name>Депримирование</name>
      <description>Депримирование</description>
    </items>
    <items>
      <name>ДисциплинарныеВзыскания</name>
      <description>Дисциплинарные взыскания</description>
    </items>
    <items>
      <name>ИсполнительныйЛист</name>
      <description>Исполнительный лист</description>
    </items>
    <items>
      <name>МагистральСПБ</name>
      <description>Магистраль СПБ</description>
    </items>
    <items>
      <name>МатериальныйУщерб</name>
      <description>Материальный ущерб</description>
    </items>
    <items>
      <name>НадбавкиПоЗаказам</name>
      <description>Надбавки по заказам</description>
    </items>
    <items>
      <name>НачислениеЗаПодъем</name>
      <description>Начисление за подъем</description>
    </items>
    <items>
      <name>НачислениеОсновное</name>
      <description>Начисление основное</description>
    </items>
    <items>
      <name>НочнойВодитель</name>
      <description>Ночной водитель</description>
    </items>
    <items>
      <name>ОтпускныеБольничные</name>
      <description>Отпускные больничные</description>
    </items>
    <items>
      <name>ПодработкаНаСкладе</name>
      <description>Подработка на складе</description>
    </items>
    <items>
      <name>Премия</name>
      <description>Премия</description>
    </items>
    <items>
      <name>Пропуска</name>
      <description>Пропуска</description>
    </items>
    <items>
      <name>ТарифПоКонтрагенту</name>
      <description>Тариф по контрагенту</description>
    </items>
    <items>
      <name>ШтрафыПДД</name>
      <description>Штрафы ПДД</description>
    </items>
  </predefined>
  <attributes>
    <name>НачислениеУдержание</name>
    <type>
      <types>EnumRef.мгНачислениеУдержание</types>
    </type>
  </attributes>
</mdclass:Catalog>

EDT/УТ/src/Documents/мгЗагрузкаИзЗУП/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр мгЗарплатаУдержания Приход
	Движения.мгЗарплатаУдержания.Записывать = Истина;
	Движения.мгЗарплатаУдержания.Очистить();
	Для Каждого ТекСтрокаАвансЗарПлата Из АвансЗарПлата Цикл
		Движение = Движения.мгЗарплатаУдержания.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = ПериодРегистрации;
		Движение.Организация = Организация;
		Движение.Терминал = Терминал;
		Движение.ВидУдержания = ПредопределенноеЗначение("Справочник.мгНачисленияУдержания.ВыданАвансИЗП");
		Движение.Сотрудник = ТекСтрокаАвансЗарПлата.Сотрудник;
		Движение.Тариф = ТекСтрокаАвансЗарПлата.Сумма;
	КонецЦикла;

	Для Каждого ТекСтрокаИсполнительныйЛист Из ИсполнительныйЛист Цикл
		Движение = Движения.мгЗарплатаУдержания.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = ПериодРегистрации;
		Движение.Организация = Организация;
		Движение.Терминал = Терминал;
		Движение.ВидУдержания = ПредопределенноеЗначение("Справочник.мгНачисленияУдержания.ИсполнительныйЛист");
		Движение.Сотрудник = ТекСтрокаИсполнительныйЛист.Сотрудник;
		Движение.Тариф = ТекСтрокаИсполнительныйЛист.Сумма;
	КонецЦикла;

	Для Каждого ТекСтрокаОтпускныеБольничные Из ОтпускныеБольничные Цикл
		Движение = Движения.мгЗарплатаУдержания.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = ПериодРегистрации;
		Движение.Организация = Организация;
		Движение.Терминал = Терминал;
		Движение.ВидУдержания = ПредопределенноеЗначение("Справочник.мгНачисленияУдержания.ОтпускныеБольничные");
		Движение.Сотрудник = ТекСтрокаОтпускныеБольничные.Сотрудник;
		Движение.Тариф = ТекСтрокаОтпускныеБольничные.Сумма;
	КонецЦикла;


	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
